#include "Engine.h"

//----------------------------------------------------------------------------
//! @file   Engine.cpp
//! @brief エンジンの実装
//! @detail シーン内オブジェクトの管理とライフサイクル処理を提供します。
//----------------------------------------------------------------------------

namespace ReoEngine 
{
    //-----------------------------------------------------------
    //! オブジェクトを追加
    //-----------------------------------------------------------
    void Engine::AddObject(std::unique_ptr<GameObject> obj)
    {
        gameObjects.push_back(std::move(obj));  // 管理対象に GameObject を追加（所有権移動）
    }

    //-----------------------------------------------------------
    //! 全オブジェクトの更新処理
    //-----------------------------------------------------------
    void Engine::UpdateAll()
    {
        for (auto& obj : gameObjects)
        {
            obj->Update();  // 各オブジェクトの Update を呼び出し
        }
    }

    //-----------------------------------------------------------
    //! 全オブジェクトの描画処理
    //-----------------------------------------------------------
    void Engine::DrawAll()
    {
        for (auto& obj : gameObjects)
        {
            obj->Draw();  // 各オブジェクトの Draw を呼び出し
        }
    }

    //-----------------------------------------------------------
    //! 全オブジェクトの終了処理
    //-----------------------------------------------------------
    void Engine::EndAll()
    {
        for (auto& obj : gameObjects)
        {
            obj->End();  // 各オブジェクトの End を呼び出し
        }
    }
}