//============================================================================
//! @file   Engine.cpp
//! @brief  エンジンの実装
//! @details ObjectBase のライフサイクル管理を行う実装を提供します。
//! @author レオ
//============================================================================
#include "Engine.h"

namespace Engine {
//-----------------------------------------------------------
//! @brief ObjectBase を追加する
//! @param obj 追加する ObjectBase
//-----------------------------------------------------------
void Engine::AddObject(std::shared_ptr<Object::ObjectBase> obj)
{
    m_game_objects.push_back(obj);    // コンテナに ObjectBase を登録
}

//-----------------------------------------------------------
//! @brief 登録されている全ての ObjectBase を更新する
//-----------------------------------------------------------
void Engine::UpdateAll()
{
    for(auto& obj : m_game_objects) {
        obj->Update();    // 各オブジェクトの更新処理を呼び出す
    }
}

//-----------------------------------------------------------
//! @brief 登録されている全ての ObjectBase を描画する
//-----------------------------------------------------------
void Engine::DrawAll()
{
    for(auto& obj : m_game_objects) {
        obj->Draw();    // 各オブジェクトの描画処理を呼び出す
    }
}

//-----------------------------------------------------------
//! @brief 登録されている全ての ObjectBase の終了処理を呼び出す
//-----------------------------------------------------------
void Engine::EndAll()
{
    for(auto& obj : m_game_objects) {
        obj->End();    // 各オブジェクトの終了処理を呼び出す
    }
}
}    // namespace Engine
