#pragma once
#include "GameObject.h"
#include <vector>
#include <memory>

//----------------------------------------------------------------------------
//! @file   Engine.h
//! @brief エンジンの宣言
//! @detail シーン内のオブジェクト管理を行う簡易エンジン実装の宣言
//----------------------------------------------------------------------------

namespace ReoEngine {
    //============================================================================
    //! @class  Engine
    //! シーン内の GameObject を管理するクラスです。
    //============================================================================
    class Engine
    {
    public:
        //-----------------------------------------------------------
        //! オブジェクトを追加
        //! @param  [in] obj 追加する GameObject の所有権を受け取る unique_ptr
        //-----------------------------------------------------------
        void AddObject(std::unique_ptr<GameObject> obj);

        //-----------------------------------------------------------
        //! 全オブジェクトの更新処理
        //-----------------------------------------------------------
        void UpdateAll();

        //-----------------------------------------------------------
        //! 全オブジェクトの描画処理
        //-----------------------------------------------------------
        void DrawAll();

        //-----------------------------------------------------------
        //! 全オブジェクトの終了処理
        //-----------------------------------------------------------
        void EndAll();

    private:
        std::vector<std::unique_ptr<GameObject>> gameObjects; //!< 管理する GameObject コンテナ
    };
}