#include "GameObject.h"


//----------------------------------------------------------------------------
//! @file   GameObject.cpp
//! @brief ゲームオブジェクトの実装
//! @detail コンポーネントのライフサイクル管理を行います。
//----------------------------------------------------------------------------

//-----------------------------------------------------------
//! デストラクタ
//-----------------------------------------------------------
GameObject::~GameObject() {
    End(); // コンポーネントの終了処理
}

//-----------------------------------------------------------
//! 全コンポーネントの初期化処理
//-----------------------------------------------------------
void GameObject::Init() {
    // コンポーネントの初期化
    for (auto& comp : components_) {
        comp->Init();
    }
    OnInit(); // 派生クラスの初期化処理呼び出し
}

//-----------------------------------------------------------
//! 全コンポーネントの更新処理
//-----------------------------------------------------------
void GameObject::Update() {
    for (auto& comp : components_) {
        comp->Update();
    }
    OnUpdate(); // 派生クラスの更新処理呼び出し
}

//-----------------------------------------------------------
//! 全コンポーネントの描画処理
//-----------------------------------------------------------
void GameObject::Draw() {
    for (auto& comp : components_) {
        comp->Draw();
    }
    OnDraw(); // 派生クラスの描画処理呼び出し
}

//-----------------------------------------------------------
//! 全コンポーネントの終了処理
//-----------------------------------------------------------
void GameObject::End() {
    for (auto& comp : components_) {
        comp->End();
    }
    components_.clear();
    OnEnd(); // 派生クラスの終了処理呼び出し
}