#pragma once
#include "Struct.h"
//---------------------------------------------------------------------------------
//	定数
//---------------------------------------------------------------------------------
enum 
{
	MODE_OFF,	//押されていない
	MODE_ON,	//押されている
};
//---------------------------------------------------------------------------------
//	関数
//---------------------------------------------------------------------------------
void Image_ButtonInit  ();
void Image_ButtonUpdate();
void Image_ButtonRender();

//---------------------------------------------------------------------------------
//	画像ボタンclass
//	画像を読み込みボタンとして使えるようにするクラス
//---------------------------------------------------------------------------------
class Image_Botton
{
public:
	//メンバ関数 
	void Init(const char* path, float x, float y);//初期化処理
	void Update();//更新処理
	void Render();//描画処理

	//デストラクタ
	~Image_Botton();

	//値を返すメンバ関数
	bool Push_Mode();//クリックの状態
	float  W();		 //幅
	float  H();		 //高さ

private:
	//メンバ変数
	int		  image_     = 0;		  //画像
	float	  scale_     = 0;		  //拡大率
	bool	  push_mode_ = MODE_OFF;  //ボタンが押されているか
	bool	  drawmode_  = true;	  //描画するか
	Float_Pos size_      = { 0.0f };  //幅と高さ
	Float_Pos pos_       = { 0.0f };  //座標
};

