#include "SceneBase.h"

namespace Scene
{
	//-----------------------------------------------------------
	/// @brief シーン初期化
	//-----------------------------------------------------------
	void SceneBase::Init()
	{
		ObjectInit();  // オブジェクトの初期化
		SceneInit();   // シーン固有初期化
	}

	//-----------------------------------------------------------
	/// @brief シーン更新
	//-----------------------------------------------------------
	void SceneBase::Update()
	{
		ObjectUpdate(); // オブジェクト更新
		SceneUpdate();  // シーン固有更新（オブジェクト間連携など）
	}

	//-----------------------------------------------------------
	/// @brief シーン描画
	//-----------------------------------------------------------
	void SceneBase::Draw()
	{
		ObjectDraw();  // オブジェクト描画
		SceneDraw();   // シーン固有描画
	}

	//-----------------------------------------------------------
	/// @brief シーン終了処理
	//-----------------------------------------------------------
	void SceneBase::End()
	{
		ObjectEnd();  // オブジェクト終了処理
		SceneEnd();   // シーン固有終了処理
	}

	//-----------------------------------------------------------
	/// @brief オブジェクトを追加
	/// @param obj 追加するオブジェクト(shared_ptr)
	//-----------------------------------------------------------
	void SceneBase::AddObject(std::shared_ptr<GameObject> obj)
	{
		obj->Init();
		scene_objects_.push_back(obj);
	}

	//-----------------------------------------------------------
	/// @brief 全オブジェクト初期化
	//-----------------------------------------------------------
	void SceneBase::ObjectInit()
	{
		for (auto& obj : scene_objects_) {
			obj->Init();
		}
	}

	//-----------------------------------------------------------
	/// @brief 全オブジェクト更新
	//-----------------------------------------------------------
	void SceneBase::ObjectUpdate()
	{
		for (auto& obj : scene_objects_) {
			obj->Update();
		}
	}

	//-----------------------------------------------------------
	/// @brief 全オブジェクト描画
	//-----------------------------------------------------------
	void SceneBase::ObjectDraw()
	{
		for (auto& obj : scene_objects_) {
			obj->Draw();
		}
	}

	//-----------------------------------------------------------
	/// @brief 全オブジェクト終了処理
	//-----------------------------------------------------------
	void SceneBase::ObjectEnd()
	{
		for (auto& obj : scene_objects_) {
			obj->End();
		}
		scene_objects_.clear();
	}
}