//============================================================================
//! @file   SceneBase.cpp
//! @brief  シーン基底クラスの実装
//! @details シーン内のオブジェクト管理およびライフサイクル処理を提供します。
//! @author レオ
//============================================================================
#include "SceneBase.h"

namespace Scene {
//-----------------------------------------------------------
//! @brief シーン初期化
//-----------------------------------------------------------
void SceneBase::Init()
{
    ObjectInit();    // オブジェクトの初期化
    SceneInit();     // シーン固有初期化
}

//-----------------------------------------------------------
//! @brief シーン更新
//-----------------------------------------------------------
void SceneBase::Update()
{
    ObjectUpdate();    // オブジェクト更新
    SceneUpdate();     // シーン固有更新
}

//-----------------------------------------------------------
//! @brief シーン描画
//-----------------------------------------------------------
void SceneBase::Draw()
{
    ObjectDraw();    // オブジェクト描画
    SceneDraw();     // シーン固有描画
}

//-----------------------------------------------------------
//! @brief シーン終了処理
//-----------------------------------------------------------
void SceneBase::End()
{
    ObjectEnd();    // オブジェクト終了処理
    SceneEnd();     // シーン固有終了処理
}

//-----------------------------------------------------------
//! @brief オブジェクトをシーンに追加
//! @param obj_name 追加するオブジェクトの名前
//-----------------------------------------------------------
void SceneBase::AddObject(std::shared_ptr<Object::ObjectBase> obj)
{
    m_scene_objects.push_back(obj);
}

//-----------------------------------------------------------
//! @brief シーン内オブジェクトの初期化処理
//-----------------------------------------------------------
void SceneBase::ObjectInit()
{
    for(auto& obj : m_scene_objects) {
        obj->Init();
    }
}

//-----------------------------------------------------------
//! @brief シーン内オブジェクトの更新処理
//-----------------------------------------------------------
void SceneBase::ObjectUpdate()
{
    for(auto& obj : m_scene_objects) {
        obj->Update();
    }
}

//-----------------------------------------------------------
//! @brief シーン内オブジェクトの描画処理
//-----------------------------------------------------------
void SceneBase::ObjectDraw()
{
    for(auto& obj : m_scene_objects) {
        obj->Draw();
    }
}

//-----------------------------------------------------------
//! @brief シーン内オブジェクトの終了処理
//-----------------------------------------------------------
void SceneBase::ObjectEnd()
{
    for(auto& obj : m_scene_objects) {
        obj->End();
    }
    m_scene_objects.clear();
}
}    // namespace Scene
